W6/D3/routes_and_cont/routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "person"], ["email", "email\n"], ["created_at", "2021-10-06 23:08:21.704177"], ["updated_at", "2021-10-06 23:08:21.704177"]]
---
  def create
    user = User.new(user_params)
    # debugger
    if user.save

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "john"], ["email", "diff_email"], ["updated_at", "2021-10-06 23:19:24.961019"], ["id", 2]]
---
  def edit
    user = User.update(params[:id], user_params)