W6/D3/ArtAPI/app/controllers/comments_controller.rb

  def create
    # debugger
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artwork_id", 6], ["body", "Bad art"], ["created_at", "2021-10-07 21:36:57.596942"], ["updated_at", "2021-10-07 21:36:57.596942"]]

  def index
    render json: Comment.all
---
SELECT "comments".* FROM "comments"