W6/D3/ArtAPI/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bob"], ["email", "email@email"], ["username", "Bobbers"], ["created_at", "2021-10-07 19:01:06.719567"], ["updated_at", "2021-10-07 19:01:06.719567"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Rob"], ["updated_at", "2021-10-07 19:01:32.233697"], ["id", 3]]